# Parameters
nc: 1

scales:
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]


backbone:
  # ---------- input ----------
  - [-1, 1, IN, []]              # 0  GE + S2
  - [-1, 1, MultiIn, [1, 3]]        # 1  GE
  - [-2, 1, MultiIn, [2, 3]]        # 2  S2

  # Stage P1 / P2
  # GE branch
  - [1, 1, SPDConv, [32, 2, 3]]  # 3  P1/2
  - [-1, 1, SPDConv, [64, 2, 3]]# 4  P2/4
  - [-1, 1, C2PDS, [64]]        # 5
  # S2 branch
  - [2, 1, SPDConv, [32, 2, 3]]  # 6  P1/2
  - [-1, 1, SPDConv, [64, 2, 3]]# 7  P2/4
  - [-1, 1, C2PDS, [64]]        # 8
  - [[5, 8], 1, S2AFM, [64]]    # 9 Fused P2

  # Stage P3
  - [5, 1, SPDConv, [128, 2, 3]] # 10   GE P3/8
  - [8, 1, SPDConv, [128, 2, 3]] # 11  S2 P3/8
  - [-2, 1, C2PDS, [128]]        # 12  GE P3
  - [-2, 1, C2PDS, [128]]        # 13  S2 P3
  - [[12, 13], 1, S2AFM, [128]]  # 14  Fused P3

  # Stage P4
  - [12, 1, SPDConv, [256, 2, 3]] # 15 GE P4/16
  - [13, 1, SPDConv, [256, 2, 3]] # 16 S2 P4/16
  - [-2, 1, C2PDS, [256]]         # 17 GE P4
  - [-2, 1, C2PDS, [256]]         # 18 S2 P4
  - [[17, 18], 1, S2AFM, [256]]   # 19 Fused P4

  # ---------- context enhancement ----------
  - [-1, 1, SPPF, [512, 5]]       # 20
  - [-1, 1, C2PSA, [512]]         # 21 P4

# Head (P3 / P4 only)

head:
  # FPN
  # P4 -> up -> concat P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 22
  - [[-1, 14], 1, Concat, [1]]          # 23 cat P3 (stride=8)
  - [-1, 2, C2PDS, [128, False]]         # 24

  # -> up -> concat P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 25
  - [[-1, 9], 1, Concat, [1]]          # 26 cat backbone P2 (stride=4)
  - [-1, 2, C2PDS, [64, False]]         # 27 head small (stride=4)

  # PAN
  # small -> down -> concat head level-1
  - [-1, 1, SPDConv, [64, 2, 3]]       # 28
  - [[-1, 24], 1, Concat, [1]]          # 29
  - [-1, 2, C2PDS, [128, False]]         # 30 head medium (stride=8)
  # medium -> down -> concat P4
  - [-1, 1, SPDConv, [128, 2, 3]]       # 31
  - [[-1, 21], 1, Concat, [1]]          # 32 cat backbone P4 (stride=16)
  - [-1, 2, C2PDS, [256, True]]         # 33 head large (stride=16)

  - [ [27, 30, 33], 1, Segment, [ nc, 32, 256 ] ]